Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведния)

	//Определить, нужно ли обнолять дату в движениях.
	ОбновитьДатуДвижения = ЭтоНовый() Или Движения.ОстаткиПродукции.Модифицированность();
	Если не ОбновитьДатуДвижения Тогда
		
		//Проверить, что дата изменилась.
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|		 Дата
		|ИЗ
		|		 Документ.ВводНачальныхОстатковНоменклатуры
		|ГДЕ
		| Ссылка = &ТекущийДокумент";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		ОбновитьДатуДвижения = Выборка.Дата > Дата;
	КонецЕсли;
	
	//Установить всем новыую дату, если нужно.
	Если ОбновитьДатуДвижения Тогда
		
		Если Не Движения.ОстаткиПродукции.Выбран() И Не
			Движения.ОстаткиПродукции.Модифицированность() Тогда
			Движения.ОстаткиПродукции.Прочитать();
			
		КонецЕсли;
		
		Для Каждого ЗаписьРегистра Из Движения.ОстаткиПродукции Цикл
			ЗаписьРегистра.Период = Дата;
			
		КонецЦикла; 
	
	КонецЕсли;
	

		КонецПроцедуры
